
Функция ПолучитьТекстШапкиОпроса(ДатаНачалаНедели, ДатаКонцаНедели) Экспорт
	
	ТекстШапки = СтрШаблон("Расписание на неделю с %1 по %2", Формат(ДатаНачалаНедели, "ДЛФ=DD"), Формат(ДатаКонцаНедели, "ДЛФ=DD"));
	
	Возврат ТекстШапки;
	
КонецФункции

Функция ПолучитьНомерДокумента(ДатаДокумента) Экспорт

	Если Час(ДатаДокумента) <= 12 Тогда
		Идентификатор = "У";  
	ИначеЕсли Час(ДатаДокумента) <= 16 Тогда 
		Идентификатор = "Д";
	Иначе
		Идентификатор = "В";
	КонецЕсли;
	
	Номер = Формат(ДатаДокумента, "ДФ=ддММгггг_") + Идентификатор;
	
	Возврат Номер;

КонецФункции // ПолучитьНомерДокумента()

Функция ПолучитьПредставлениеСлужбы(ДеньНедели, Разрез, ДатаСлужбы, ВремяСлужбы) Экспорт

	ПредставлениеСлужбы = Строка(ДеньНедели) + " " + НРег(Разрез) + 
								" (" + Строка(Формат(ДатаСлужбы,"ДФ='д ММММ'")) + 
								" в " + Строка(Формат(ВремяСлужбы, "ДФ=Ч:мм")) + ")";	
    Возврат ПредставлениеСлужбы;
КонецФункции // ПолучитьПредставлениеСлужбы()



