Функция ПолучитьПредставлениеДляОпросаВТГ(ДокументРегистратор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланировкаРасписанияTEST.ДатаСлужбы КАК ДатаСлужбы,
		|	ПланировкаРасписанияTEST.ВремяСлужбы КАК ВремяСлужбы,
		|	ПланировкаРасписанияTEST.ДеньНедели КАК ДеньНедели,
		|	ПРЕДСТАВЛЕНИЕ(ПланировкаРасписанияTEST.Разрез) КАК Разрез
		|ИЗ
		|	РегистрСведений.ПланировкаРасписанияTEST КАК ПланировкаРасписанияTEST
		|ГДЕ
		|	ПланировкаРасписанияTEST.Регистратор = &ДокументРегистратор";
	
	Запрос.УстановитьПараметр("ДокументРегистратор", ДокументРегистратор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСлужбНедели = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ПредставлениеСлужбы = Серверный.ПолучитьПредставлениеСлужбы(Выборка.ДеньНедели, Выборка.Разрез, Выборка.ДатаСлужбы, Выборка.ВремяСлужбы);
		МассивСлужбНедели.Добавить(ПредставлениеСлужбы);
	КонецЦикла;
	
	Возврат МассивСлужбНедели;

КонецФункции // ПолучитьПредставлениеДляОпросаВТГ(ДокументРегистратор)    

Функция ПолучитьНачалоНеделиРасписания(ДокументРегистратор) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПланировкаРасписанияTEST.ДатаСлужбы КАК ДатаСлужбы       
		|ИЗ
		|	РегистрСведений.ПланировкаРасписанияTEST КАК ПланировкаРасписанияTEST
		|ГДЕ
		|	ПланировкаРасписанияTEST.Регистратор = &ДокументРегистратор";
	
	Запрос.УстановитьПараметр("ДокументРегистратор", ДокументРегистратор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НачалоВыбираемойНедели = НачалоНедели(Выборка.ДатаСлужбы);
	КонецЦикла;
	
	Возврат НачалоВыбираемойНедели;
	
КонецФункции // ПолучитьНачалоНеделиРасписания(ДокументРегистратор)

