
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ИмяПользователяВ_TG
	Движения.ИмяПользователяИID_В_TG.Записывать = Истина;
	Для Каждого ТекСтрокаСписокПользователей Из СписокПользователей Цикл
		Движение = Движения.ИмяПользователяИID_В_TG.Добавить();
		Движение.Период = Дата;
		Движение.Пользователь = ТекСтрокаСписокПользователей.Пользователь;
		Движение.ИмяПользователя = ТекСтрокаСписокПользователей.ИмяПользователя; 
		Движение.IDПользователя = ТекСтрокаСписокПользователей.IDПользователя;
	КонецЦикла;

КонецПроцедуры
