
Функция СоздатьДокИзПлана(ДатаСоздаваемого, НаименованиеСлужбы) Экспорт
	
	НомерДока = Серверный.ПолучитьНомерДокумента(ДатаСоздаваемого);
	Если НЕ НайтиПоНомеру(НомерДока).Пустая() Тогда
		Сообщение = СтрШаблон("Документ на дату %1 уже существует. Номер документа %2.", Формат(ДатаСоздаваемого, "ДЛФ=DDT"), НомерДока);
		Сообщить(Сообщение);
		Возврат Неопределено
	КонецЕсли;
	
	НовыйДок = СоздатьДокумент();
	НовыйДок.Дата = ДатаСоздаваемого; 
	НовыйДок.Наименование = НаименованиеСлужбы;
	НовыйДок.Записать();
	
	СсылкаНового = НовыйДок.Ссылка;
	
	Возврат СсылкаНового;

КонецФункции