
#Область СлужебныеПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТокенИнициатора = "Ввести_Сюда_Токен_Телеграм_Бота";
	chat_id = "Ввести_Сюда_ID_Чата";
КонецПроцедуры

&НаКлиенте
Процедура РегистраторПриИзменении(Элемент)
	ШапкаОпроса = ПолучитьШапкуОпроса();
КонецПроцедуры          

#КонецОбласти

#Область Инструменты

&НаСервере
Функция ПолучитьРасписаниеИзРегистра()

	Возврат РегистрыСведений.ПланировкаРасписанияTEST.ПолучитьПредставлениеДляОпросаВТГ(Регистратор)

КонецФункции // ПолучитьРасписаниеИзРегистра()

&НаСервере
Функция ПолучитьШапкуОпроса() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаРасписанияTEST.ИдентификаторНедели КАК ИдентификаторНедели
		|ИЗ
		|	Документ.УстановкаРасписанияTEST КАК УстановкаРасписанияTEST
		|ГДЕ
		|	УстановкаРасписанияTEST.Ссылка = &СсылкаНаРегистратор";
	
	Запрос.УстановитьПараметр("СсылкаНаРегистратор", Регистратор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекстШапки = Выборка.ИдентификаторНедели;
	КонецЦикла;
	
	Возврат ТекстШапки;
	
КонецФункции // ПолучитьШапкуОпроса()


&НаСервере
Процедура ИзменитьСтатусОпросаВДокументе()

	НашДок = Регистратор.ПолучитьОбъект();
	НашДок.СтатусОпроса = Перечисления.СтатусОпроса.ИдетГолосование;
	НашДок.Записать();

КонецПроцедуры

#КонецОбласти

#Область Действие

&НаКлиенте
Процедура ОтобразитьВариантыОтветовОпроса(Команда)
	МассивОтветовОпроса = ПолучитьРасписаниеИзРегистра();
	ПредставлениеМассива = "";
	Для каждого ВариантОтвета Из МассивОтветовОпроса Цикл
		ПредставлениеМассива = ПредставлениеМассива + Символы.ПС + ВариантОтвета;	
	КонецЦикла;	
	ПредставлениеОпроса = ПредставлениеМассива;	
КонецПроцедуры   

&НаКлиенте
Процедура СоздатьОпросПоНаборуЗаписей(Команда)
	МассивОтветов = ПолучитьРасписаниеИзРегистра();
	Ответ = СоздатьОпросПоНаборуЗаписейНаСервере(ТокенИнициатора, chat_id, ШапкаОпроса, МассивОтветов);
	
	Если Не Ответ["ok"] Тогда 
		ТекстСообщения = СтрШаблон("При отправке опроса произошла ошибка. Обратитесь к администратору. %1Код ошибки: %2 %1Текст ошибки: ""%3""", 
																		Символы.ПС, Ответ["error_code"], Ответ["description"]);   
		ПоказатьПредупреждение(, ТекстСообщения, , "Ошибка отправки опроса");  
		Возврат
	КонецЕсли;
	
	РезультатОтвета = Ответ["result"]; 
	ДанныеОпроса = РезультатОтвета["poll"];                                                                                
	
	//Дату создания опроса получаем в формате Unix - количество секунд, прошедших с 01.01.1970 00:00:00 (ТаймШтамп формата)
	ДатаСоздОпросаUnix = РезультатОтвета["date"];
	ДатаОпросаUTC = Клиентский.ПеревестиUnixДату(ДатаСоздОпросаUnix);
	
	IDОпроса = ДанныеОпроса["id"];  //ID опроса (poll_id) 
	IDСообщения = РезультатОтвета["message_id"]; //ID сообщения  
	ДатаСозданияОпроса = ДатаОпросаUTC;
	ИзменитьСтатусОпросаВДокументе();
КонецПроцедуры  

&НаСервере
Функция СоздатьОпросПоНаборуЗаписейНаСервере(Токен, IDЧата, Вопрос, МассивОтветов)
	Возврат Действие.ОтправитьОпрос(Токен, IDЧата, Вопрос, МассивОтветов, Ложь, Истина);
КонецФункции

#КонецОбласти

#Область СохранениеВРеестр

&НаКлиенте
Процедура СохранитьIDСообщенияВРеестр(Команда)
	СохранитьIDСообщенияВРеестрНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьIDСообщенияВРеестрНаСервере()
	
	ДокОбъект = Регистратор.ПолучитьОбъект();
	ДокОбъект.IDОпроса = IDОпроса;
	ДокОбъект.IDСообщения = IDСообщения;  
	ДокОбъект.ДатаСозданияОпроса = ДатаСозданияОпроса;
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	ЗаписьВРегистр = РегистрыСведений.IDОпроса.СоздатьНаборЗаписей();
	ДобавитьВЗапись = ЗаписьВРегистр.Добавить();
	ДобавитьВЗапись.Период = ТекущаяДатаСеанса(); 
	ДобавитьВЗапись.ДокументУстановкиРасписания = Регистратор;
	ДобавитьВЗапись.IDОпроса = IDОпроса;
	ДобавитьВЗапись.IDСообщения = IDСообщения;   
	ДобавитьВЗапись.ДатаСозданияОпроса = ДатаСозданияОпроса;
	ЗаписьВРегистр.Записать();
	
КонецПроцедуры


#КонецОбласти




