
&НаКлиенте
Процедура СписокПользователейПользовательПриИзменении(Элемент)
	СтрокаТЧ = Элементы.СписокПользователей.ТекущиеДанные;  
	СтрокаТЧ.ИмяПользователя = ПолучитьАктуальноеИмяПользователя(СтрокаТЧ.Пользователь);
КонецПроцедуры

&НаСервере
Функция ПолучитьАктуальноеИмяПользователя(Пользователь)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИмяПользователяИID_В_TGСрезПоследних.ИмяПользователя КАК ИмяПользователя
		|ИЗ
		|	РегистрСведений.ИмяПользователяИID_В_TG.СрезПоследних(, Пользователь = &Пользователь) КАК ИмяПользователяИID_В_TGСрезПоследних";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ИмяПользователя;	
	КонецЦикла;
КонецФункции

